Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.Value Property
 The result value.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Value { get; set; }
Public Property Value As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace